export const categoryMap: Record<string, string> = {
  "10": "1성",
  "20": "2성",
  "30": "3성",
  "40": "4성",
  "50": "5성",
  "51": "전1",
  "52": "전2",
  "53": "전3",
  "54": "전4",
};

export const translations: Record<string, string> = {
  총력전: "総力戦",
  대결전: "大決戦",
  시가지: "市街地",
  야외: "屋外",
  실내: "屋内",
  특수장갑: "特殊装甲", 
  경장갑: "軽装備",
  중장갑: "重装備",
  탄력장갑: "弾力装甲",
  비나: "ビナー",
  헤세드: "ケセド",
  시로쿠로: "シロ",
  예로니무스: "ヒエロ",
  카이텐: "カイテン",
  페로로지라: "ペロロジラ",
  호드: "ホド",
  고즈: "ゴズ",
  호버크래프트: "ホバー",
  그레고리오: "グレゴリオ",
  쿠로카게: "クロカゲ",
  게부라: "ゲブラ",
  예소드: "イェソド",
};

export const basePartyCounts: number[] = [
  100, 200, 500, 1000, 2000, 5000, 10000, 20000,
];

export const tormentMinScore = 31000000;
export const lunaticMinScore = 44000000;